#a = [1, 2, 3]
#b = a
# значения списка b? будет 1, 2, 3

#a[1] = 10
# значения списка b? 1, 10, 3

#b[0] = 20
# значения списка a? 20, 2, 3

#a = [5, 6]
# значения списка b? 5, 6


#Запишите значения списков в одну строку, разделяя списки точкой с запятой, а элементы внутри списка — пробелом, например:
#1 1 1; 2 2 2; 3 3 3; 4 4 4

a = [1, 2, 3]
b = a
for i in b:
    print(i, end = " ")
print("; ",end = "")
a[1] = 10
for i in b:
    print(i, end = " ")
print("; ",end = "")
b[0] = 20
for i in a:
    print(i, end = " ")
print("; ",end = "")
a = [5, 6]
for i in b:
    print(i, end = " ")
