#Ник хочет написать программу, которая проверяет, сколько раз в строке встречается наибольшая цифра.
#Напишите программу, которая на вход с клавиатуры принимает строку, состоящую из цифр. 
#В терминал программа должна вывести число – количество раз, которое наибольшая цифра встречается в этой строке.

#Подсказка: можете воспользоваться int и str.

new_list = [] 
a = input(str())
max_number = max(new_list)
for max_number in new_list:
    print(max_number)








