#Коди старается практиковаться в программировании, даже когда изучает геймдизайн.

#Сегодня Коди решила вспомнить основы и написать программу, суммирующую цифры любого введенного числа.

#Программа получает на вход число, лежащее в промежутке от 0 до 10000.
#В терминал необходимо вывести сумму всех цифр введенного числа.



#Напишите программу для игры "Путешествие в Мир Строк".
# В этой игре главный герой отправляется в путешествие по удивительному миру символов. 
#При этом он обладает волшебным даром собирать из каждой строки символы, индекс которых кратен 4.
#Результаты строк после преобразований позволяют пройти через различные уровни и найти путь домой.

#Программа получает на вход с клавиатуры строку. В терминале требуется вывести строку,
# состоящую из тех элементов исходной строки, индексы которых кратны четырем.


#Ник пытается вспомнить, как сохранять введенные числа, если их количество может изменяться
# при каждом запуске программы.

#Напишите программу, которая принимает с клавиатуры натуральное 
#число n – количество чисел чисел. Затем на вход программе подается n чисел, 
#каждое на отдельной строке. В терминал требуется вывести список квадратов этих чисел, отсортированный по возрастанию.
#s = '65 93 2 99 31 21 42 13 24 1'
#s = s.split()
#for i in range(len(sp)):
#    if int(sp[i]) > 10:
#       sp[i] = int(sp[i]) // 10
#    else:
#        sp[i] = int(sp[i])
#rez = 1
#for i in sp:
#    rez *= i
#print(rez)
#or x in '0123456789':
#    t = int('' + x + 'A04', 13) + int('1D' + x + '3', 18)
#    if t % 184 == 0:
#        print(t // 184)
#        break

#def F(n):
#    if n == 1:
#        return 1
#    if n > 1:
#        return F(n-1) * n
#print(F(5))

#def F(n):
#    if n == 1:
#        return 0
#    if n > 1:
#        return F(n-1) + n
#def G(n):
#    if n == 1:
#        return 1
#    if n > 1:
#        return G(n - 1) * n
#print(F(5) + G(5))
 


